In [44]:
# !/usr/bin/env python3
import os
import pandas as pd
from sqlalchemy import create_engine
import matplotlib.pyplot as plt

In [ ]:
# Create database engine
engine = create_engine(
    "mysql+pymysql://root:password4@localhost:3306/practice_db"
)

In [ ]:
# Create database if not exists
from sqlalchemy import create_engine, text

USER = "root"
PASSWORD = "password"
HOST = "localhost"
PORT = 3306
DB = "practice_db"

# connect without DB
engine0 = create_engine(
    f"mysql+pymysql://{USER}:{PASSWORD}@{HOST}:{PORT}/"
)

with engine0.connect() as conn:
    conn.execute(text(f"CREATE DATABASE IF NOT EXISTS {DB}"))
    conn.commit()

print("✅ Database ready")

✅ Database ready

In [ ]:
# connect with DB
engine = create_engine(
    f"mysql+pymysql://{USER}:{PASSWORD}@{HOST}:{PORT}/{DB}"
)

print("✅ Connected to practice_db")

✅ Connected to practice_db

In [ ]:
# Create employees table
create_table_sql = """
CREATE TABLE IF NOT EXISTS employees (
    emp_id INT PRIMARY KEY,
    name VARCHAR(50),
    salary INT,
    department VARCHAR(50)
);
"""

with engine.connect() as conn:
    conn.execute(text(create_table_sql))
    conn.commit()

print("✅ employees table created")

✅ employees table created

In [ ]:
# Insert data into employees table
insert_sql = """
INSERT INTO employees (emp_id, name, salary, department) VALUES
(1,'Alice',70000,'IT'),
(2,'Bob',60000,'HR'),
(3,'Charlie',90000,'IT'),
(4,'David',50000,'HR'),
(5,'Eva',80000,'Finance')
ON DUPLICATE KEY UPDATE
name=VALUES(name),
salary=VALUES(salary),
department=VALUES(department);
"""

with engine.connect() as conn:
    conn.execute(text(insert_sql))
    conn.commit()

print("✅ Data inserted")

✅ Data inserted

In [ ]:
# Query all employees
import pandas as pd

df = pd.read_sql("SELECT * FROM employees;", engine)
df

   emp_id     name  salary department
0       1    Alice   70000         IT
1       2      Bob   60000         HR
2       3  Charlie   90000         IT
3       4    David   50000         HR
4       5      Eva   80000    Finance

In [51]:
#TOP-N (Top 3 salaries per department)
query = """SELECT *
FROM ( 
         SELECT 
         emp_id, 
         name, 
         salary, 
         department, 
         dense_rank() OVER(
            PARTITION BY 
            department 
            ORDER BY 
            salary DESC 
            ) as rnk
FROM employees ) t
WHERE rnk <= 3;"""

pd.read_sql(query, engine)

   emp_id     name  salary department  rnk
0       5      Eva   80000    Finance    1
1       2      Bob   60000         HR    1
2       4    David   50000         HR    2
3       3  Charlie   90000         IT    1
4       1    Alice   70000         IT    2

In [ ]:
#TOP-N (Top 3 salaries per department) using ROW_NUMBER()
query = """ SELECT *
FROM ( 
        SELECT 
        emp_id, 
        name, 
        salary, 
        department,
        ROW_NUMBER() OVER(
        PARTITION BY department 
        ORDER BY salary DESC ) as row_num
        FROM employees ) t
WHERE row_num <= 3;          """
pd.read_sql(query, engine)

   emp_id     name  salary department  row_num
0       5      Eva   80000    Finance        1
1       2      Bob   60000         HR        1
2       4    David   50000         HR        2
3       3  Charlie   90000         IT        1
4       1    Alice   70000         IT        2

In [ ]:
# Second highest salary per department
query = """
SELECT
    department,
    MAX(salary) AS second_highest_salary
FROM employees e1
WHERE salary < (
    SELECT MAX(salary)
    FROM employees e2
    WHERE e1.department = e2.department
)
GROUP BY department;
"""
pd.read_sql(query, engine)

  department  second_highest_salary
0         IT                  70000
1         HR                  50000

In [54]:
#2nd Highest Salary Overall (Company-wide)
query = """ SELECT emp_id, 
            name, 
            salary
            FROM (
                SELECT 
                emp_id,
                name,
                salary,
                DENSE_RANK() OVER (ORDER BY salary DESC) as O_rnk
                FROM employees
                ) t
            WHERE O_rnk = 2;    
            """
pd.read_sql(query, engine)

   emp_id name  salary
0       5  Eva   80000

In [58]:
#Employees earning more than department average
query=""" SELECT e.emp_id,
                 e.name,
                 e.salary,
                 e.department
            FROM employees e
            JOIN (SELECT department,AVG(salary) AS avg_salary
                  FROM employees
                  GROUP BY department) d
                  ON e.department = d.department
                  WHERE e.salary > d.avg_salary;
          """
pd.read_sql(query, engine)

   emp_id     name  salary department
0       2      Bob   60000         HR
1       3  Charlie   90000         IT

In [59]:
#Employees earning more than company average
query = """ SELECT emp_id,
                   salary,
                   department
            FROM employees
            WHERE salary > (SELECT AVG(salary) FROM employees)
"""
pd.read_sql(query, engine)

   emp_id  salary department
0       3   90000         IT
1       5   80000    Finance

In [ ]:
#